tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
brew "gmp"
brew "coreutils"
brew "libyaml"
brew "readline"
brew "asdf"
brew "bat"
brew "glib"
brew "cmake"
brew "libssh2"
brew "curl"
brew "exa"
brew "fd"
brew "flux"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "tcl-tk"
brew "git-gui"
brew "gnupg"
brew "harfbuzz"
brew "jq"
brew "lazygit"
brew "libsass"
brew "mkcert"
brew "neovim"
brew "openjdk@11"
brew "openapi-generator"
brew "openjdk"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "python@3.9"
brew "ripgrep"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"
brew "jakehilborn/jakehilborn/displayplacer"
cask "datagrip"
cask "dbeaver-community"
cask "docker"
cask "figma"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "menumeters"
cask "microsoft-edge"
cask "notion"
cask "pycharm"
cask "rubymine"
cask "slack"
cask "visual-studio-code"
cask "webstorm"
cask "zoom"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "capaj.graphql-codegen-vscode"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "heybourn.headwind"
vscode "IronGeek.vscode-env"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nrwl.angular-console"
vscode "orsenkucher.vscode-graphql"
vscode "Prisma.prisma"
vscode "quicktype.quicktype"
vscode "rokoroku.vscode-theme-darcula"
vscode "rvest.vs-code-prettier-eslint"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
